In [2]:
import pandas as pd
import numpy as np

In [3]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
    }

In [4]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [5]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [6]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [7]:
# Alapértelmezett praméterek, axis: index, mint a rows, how: any, ahol akár egy adat hiányzik
df.dropna(axis='index', how='any')

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [8]:
# csak ahol az OSZLOPBAN minden adat hiányzik
df.dropna(axis='columns', how='all')

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [ ]:
df.dropna(axis='columns', how='any')

In [ ]:
df.dropna(axis='index', how='any')

In [ ]:
# csak az emailt ellenőrizze
df.dropna(axis='index', how='any', subset=['email'])

In [ ]:
df.dropna(axis='index', how='all', subset=['last','email'])

In [ ]:
df.isna()

In [ ]:
df.fillna('MISSING')

In [ ]:
df.fillna(0)
df

In [ ]:
df.dtypes

In [ ]:
# Error, we need fload, because NaN is a float value under the hood
# df['age'].mean()

In [ ]:
type(np.nan)

In [ ]:
df

In [ ]:
df['age'] = df["age"].astype(float)

In [ ]:
df.dtypes

In [ ]:
df['age'].mean()

In [ ]:
na_vals = ['NA', 'Missing']
df_survey = pd.read_csv(
    'stackowerflow/survey_results_public.csv', index_col='Respondent', na_values=na_vals)

In [ ]:
pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 100)

In [ ]:
df_survey['YearsCode'].head(10)

In [ ]:
df_survey['YearsCode'].unique()

In [ ]:
df_survey['YearsCode'].replace('Less than 1 year', 0, inplace=True)

In [ ]:
df_survey['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [ ]:
df_survey['YearsCode'] = df_survey['YearsCode'].astype(float)

In [ ]:
df_survey['YearsCode'].mean()

In [ ]:
df_survey['YearsCode'].median()